app/Controllers/Home.php

SELECT *
FROM `students`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `students`
---
    public function index(): string
    {
        $studentModel = model(StudentModel::class);

        $data['students'] = $studentModel->paginate(10);

DELETE FROM `students`
WHERE `id` IN ('29')
---
    public function delete($id)
    {
        $model = model(StudentModel::class);

        if ($model->delete($id)) {